// 1.	Получить строковое название дня недели по номеру дня.
/*
let fist = +prompt('Введи номер дня недели', '');
if (fist == 1) {
    alert ('Понедельник!');
} else if (fist == 2) {
    alert ('Вторник!');
} else if (fist == 3) {
    alert ('Среда!');
} else if (fist == 4) {
    alert ('Четверг!');
} else if (fist == 5) {
    alert ('Пятница!');
} else if (fist == 6) {
    alert ('Суббота!');
} else if (fist == 7) {
    alert ('Воскресенье!');
} else {
    alert ('Некорректное число!');
}*/

// 2.	Найти расстояние между двумя точками в двухмерном декартовом пространстве.

// 3.	Вводим число(0-999), получаем строку с прописью числа.

// 4.	Вводим строку, которая содержит число, написанное прописью (0-999). Получить само число


