// 1. Заполненный квадрат

let n = 7; // количество строк или столбцов
// определение пустой строки
  let string = "";
  for(let i = 0; i < n; i++) { // внешний цикл
    for(let j = 0; j < n; j++) { //внутренний цикл
        string += "*";
    }
    // новая строка после каждой строки
    string += "\n";
  }
  //выводим строки
  console.log(string);

// 2. Полый квадрат
//
//   let n = 7;
//   let string = "";
//   for(let i = 0; i < n; i++) {
//     for(let j = 0; j < n; j++) {
//         if(i === 0 || i === n - 1) {
//             string += "*";
//         }
//         else {
//             if(j === 0 || j === n - 1) {
//                 string += "*";
//             }
//             else {
//                 string += " ";
//             }
//         }
//     }
//    string += "\n";
//   }
//   console.log(string);


// // 3. Треугольник в правом верхнем углу
//
// console.log('*******')
// console.log('*'+ ' '+ ' ' + ' '+ ' ' + '* ')
// console.log('*'+ ' '+ ' ' + ' '+ '*')
// console.log('*'+ ' '+ ' ' + '*')
// console.log('*'+ ' '+ '*')
// console.log('*'+ '*')
// console.log('*')
//
//
//
// // 4. Полый треугольник в левом углу
//
// let n = 7;
// let string = "";
//
// for (let i = 1; i <= n; i++) {
//     // printing star
//     for (let j = 0; j < i; j++) {
//         if(i === n) {
//             string += "*";
//         }
//         else {
//             if (j == 0 || j == i - 1) {
//                 string += "*";
//             }
//             else {
//                 string += " ";
//             }
//         }
//     }
//     string += "\n";
// }
// console.log(string);
//
// // 5. Полый треугольник в правом нижнем углу
// console.log(' '+ ' '+ ' ' + ' '+ ' ' + ' ' + '*')
// console.log(' '+ ' '+ ' ' + ' '+ ' ' + '*' + '*')
// console.log(' '+ ' '+ ' ' + ' '+ '*' + ' ' + '*')
// console.log(' '+ ' '+ ' ' + '*'+ ' ' + ' ' + '*')
// console.log(' '+ ' '+ '*' + ' '+ ' ' + ' ' + '*')
// console.log(' '+ '*'+ ' ' + ' '+ ' ' + ' ' + '*')
// console.log('*******')
//
// // 6.Полый треугольник в правом верхнем углу
// console.log('*******')
// console.log(' '+ '*'+ ' ' + ' '+ ' ' + ' ' + '*')
// console.log(' '+ ' '+ '*' + ' '+ ' ' + ' ' + '*')
// console.log(' '+ ' '+ ' ' + '*'+ ' ' + ' ' + '*')
// console.log(' '+ ' '+ ' ' + ' '+ '*' + ' ' + '*')
// console.log(' '+ ' '+ ' ' + ' '+ ' ' + '*' + '*')
// console.log(' '+ ' '+ ' ' + ' '+ ' ' + ' ' + '*')
//
// // 7. Крест
// console.log('*'+ ' ' + ' ' + ' ' + ' ' + ' ' + '*')
// console.log(' '+ '*' + ' ' + ' ' + ' ' + '*' + ' ')
// console.log(' '+ ' ' + '*' + ' ' + '*' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + '*' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + '*' + ' ' + '*' + ' ' + ' ')
// console.log(' '+ '*' + ' ' + ' ' + ' ' + '*' + ' ')
// console.log('*'+ ' ' + ' ' + ' ' + ' ' + ' ' + '*')
//
// // 8. Маленькая пирамида верхняя
// console.log('*'+ '*' + '*' + '*' + '*' + '*' + '*')
// console.log(' '+ '*' + ' ' + ' ' + ' ' + '*' + ' ')
// console.log(' '+ ' ' + '*' + ' ' + '*' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + '*' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + ' ' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + ' ' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + ' ' + ' ' + ' ' + ' ')
//
// // 9. Маленькая пирамида нижняя
// console.log(' '+ ' ' + ' ' + ' ' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + ' ' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + ' ' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + ' ' + '*' + ' ' + ' ' + ' ')
// console.log(' '+ ' ' + '*' + ' ' + '*' + ' ' + ' ')
// console.log(' '+ '*' + ' ' + ' ' + ' ' + '*' + ' ')
// console.log('*'+ '*' + '*' + '*' + '*' + '*' + '*')
